<h1>Ferramentas de Pandas e Numpy pra analises de dados<h1>

In [5]:
import pandas as pd #Importação da biblioteca Pandas
import numpy as np #Importação da biblioteca Numpy

In [6]:
from sklearn.ensemble import RandomForestClassifier #Importação da ferramenta de classificação
from sklearn.model_selection import train_test_split #Importação da ferramenta de moledo de divisão ente treino e texte

<h3>Leitura dos arquivos de dados em csv<h3>

In [23]:
train = pd.read_csv("train.csv") #Use o atributo read da pandas pra ler um arquivo csv
test = pd.read_csv("test.csv")

In [25]:
train.head() #Pede o cabeçalho da tabela train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [26]:
test.head() #Pede o cabeçalho da tabela test

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [27]:
train['Sex'].value_counts() #Pode-se verificar a quantdade de valores em uma coluna de uma tabela

male      577
female    314
Name: Sex, dtype: int64

In [28]:
train['Embarked'].value_counts() #Pode-se verificar a quantdade de valores em uma coluna de uma tabela

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [32]:
#Função que transforma os valores 'Female' em '1' e os valores 'Male' em '0' e cria uma coluna 'Sex_binario' com esses dados
def transformar_sex (valor):
    if valor == 'female':
        return 1
    else:
        return 0
train['Sex_binario'] = train['Sex'].map(transformar_sex)

In [33]:
train['Sex_binario'].value_counts() #Verificando que a quantidade de Male é igual a de 0, female igual a 1.

0    577
1    314
Name: Sex_binario, dtype: int64

<h3>Exemplo de como se usa a train_test_split<h3>

In [4]:
?train_test_split #Documentação da ferramenta

In [14]:
tabelaExemplo = np.arange(17) # Atribui a uma 'tabelaExemplo' um range de 17 elementos
tabelaExemplo # Solicita os dados da 'tabelaExemplo'

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16])

In [15]:
train_test_split(tabelaExemplo) # Pede-se a divisão dos dados em dois arrays, em default essa divisão será 70 e 30%.

[array([ 1, 14,  5,  7, 12, 11, 15, 13,  6,  3,  2,  8]),
 array([ 4, 16, 10,  9,  0])]

In [16]:
train_test_split(tabelaExemplo, test_size=0.5) # Pode-se definir o tamanho dos arraysb alterando o test-size para 0.5 p.ex.b

[array([ 4, 11,  2, 16, 10,  9,  5, 15]),
 array([12,  6,  1,  7,  8,  3,  0, 14, 13])]

<h3>Aplicando a train_test_split nos dados do titanic<h3>

In [35]:
variaveis = ['Sex_binario', 'Age'] #Jogamos os dados de Sex_binario e Age na variável variaveis

In [36]:
X = train[variaveis] # Jogamos as variaveis em X
y = train['Survived'] # Jogamos a coluna Survived pra y

In [37]:
X.head() # Verificação dos dados de X

   Sex_binario   Age
0            0  22.0
1            1  38.0
2            1  26.0
3            1  35.0
4            0  35.0

In [38]:
y.head() # Verificação dos dados de y

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [39]:
np.random.seed(0) #Retira a aleatoriedade do conjunto de dados pra começo dos estudos
X_treino, X_valid, y_treino, y_valid = train_test_split(X, y, test_size=0.5)
#Divide os dados em 2 partes, uma pra treino e outra pra usar na validação, nesse caso em 50%

In [47]:
X_treino.shape, X_valid.shape, y_treino.shape, y_valid.shape
# Verifique que a quantidade de X_treino e X_valid são próximas pois pedimos um test_size de 50%

((445, 2), (446, 2), (445,), (446,))

In [53]:
X_treino = X_treino.fillna(-1) # Transformando os valores NaN ou vazios de X_treino em -1

In [54]:
modelo = RandomForestClassifier(n_estimators=100, n_jobs=-1, random_state=0)
#Modelo com 100 arvores de decisão e aleatoriedade 0
modelo.fit(X_treino, y_treino)

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=None, max_features='auto',
                       max_leaf_nodes=None, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=100,
                       n_jobs=-1, oob_score=False, random_state=0, verbose=0,
                       warm_start=False)

In [56]:
X_valid = X_valid.fillna(-1) # Transformando os valores NaN ou vazios de X_valid em -1

In [59]:
p = modelo.predict(X_valid) # Predict do nosso X_valid atribuído à variável p.

In [60]:
y_valid == p
# Verificamos se a parte dos dados que separamos pra treino consegue prever a outra parte, se previu é igual a true

495     True
648     True
278    False
31      True
255     True
       ...
327     True
827     True
102     True
625     True
108     True
Name: Survived, Length: 446, dtype: bool

In [62]:
np.mean(y_valid == p) # Numero de acertos dividido pelo número de valores

0.7690582959641256

In [63]:
p.shape

(446,)